In [ ]:
import pandas as pd
import numpy as np
import datetime
import sklearn

In [ ]:
# Postulantes
postulantes = pd.read_csv('./data/postulantes_encoding_02.csv',\
                          low_memory=False)

# Avisos
avisos = pd.read_csv('./data/avisos_encoding_02.csv', \
                     low_memory=False)

# Transacciones
merged = pd.read_csv('./data/merged_encoding_02.csv', \
                     low_memory=False)

In [ ]:
postulantes.count()

In [ ]:
del postulantes['Unnamed: 0']

In [ ]:
postulantes.head()

In [ ]:
avisos.count()

In [ ]:
del avisos['Unnamed: 0']
avisos.head()

In [8]:
avisos_g = avisos
while len(avisos_g) < 504407:
    avisos_g = pd.concat([avisos_g, avisos])

In [9]:
avisos_g.count()

idaviso                 505760
nombre_zona             505760
tipo_de_trabajo         505760
nivel_laboral           505760
nombre_area             505760
denominacion_empresa    505760
dtype: int64

In [10]:
avisos_g = avisos_g[:504407]
avisos_g = sklearn.utils.shuffle(avisos_g)
avisos_g.count()

idaviso                 504407
nombre_zona             504407
tipo_de_trabajo         504407
nivel_laboral           504407
nombre_area             504407
denominacion_empresa    504407
dtype: int64

In [11]:
avisos_g = avisos_g.reset_index().drop('index',axis=1)

In [12]:
a_y_p = pd.concat([postulantes, avisos_g], axis = 1)
a_y_p.head()

,idpostulante,sexo,edad,estado,nivel_alcanzado,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,NM5M,1,47.0,1,0.0,1112417729,1,1,1,0,2799
1,5awk,1,55.0,1,0.0,1112355585,1,1,0,0,2926
2,ZaO5,1,39.0,1,0.0,1111671997,1,0,0,0,2761
3,NdJl,2,49.0,0,1.0,1112355102,1,1,0,3,346
4,eo2p,2,37.0,1,1.0,1112344509,1,1,1,0,312

In [13]:
del merged['Unnamed: 0']
merged.head()

,idaviso,idpostulante,sexo,edad,estado,nivel_alcanzado,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,1112257047,NM5M,1,47.0,1,0.0,1,0,0,3,1369
1,1112257047,1kJqGb,1,34.0,1,0.0,1,0,0,3,1369
2,1112257047,eOE9Rr,1,39.0,0,0.0,1,0,0,3,1369
3,1112257047,Zrx8Xz,1,39.0,1,0.0,1,0,0,3,1369
4,1112257047,ZrKNQY,1,32.0,1,0.0,1,0,0,3,1369

Excluimos las combinaciones de avisos y postulantes que estén en el data frame de postulaciones, de manera tal que nos queden las "no postulaciones".

In [14]:
a_y_p = a_y_p.drop(pd.merge(a_y_p,merged,\
    how='inner',on=['idpostulante','idaviso']).index,axis=0)
a_y_p.count()

idpostulante            504121
sexo                    504121
edad                    504121
estado                  504121
nivel_alcanzado         504121
idaviso                 504121
nombre_zona             504121
tipo_de_trabajo         504121
nivel_laboral           504121
nombre_area             504121
denominacion_empresa    504121
dtype: int64

In [15]:
a_y_p['sepostulo'] = 0
a_y_p.head(2)

,idpostulante,sexo,edad,estado,nivel_alcanzado,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa,sepostulo
286,85AMz,2,38.0,0,0.0,1111371931,1,1,0,7,3962,0
287,aXm1J,2,66.0,0,0.0,1111374387,1,1,0,0,529,0

In [16]:
merged['sepostulo'] = 1
merged.count()

idaviso                 7742942
idpostulante            7742942
sexo                    7742942
edad                    7742942
estado                  7742942
nivel_alcanzado         7742942
nombre_zona             7742942
tipo_de_trabajo         7742942
nivel_laboral           7742942
nombre_area             7742942
denominacion_empresa    7742942
sepostulo               7742942
dtype: int64

In [17]:
train_data = pd.concat([a_y_p, merged])
train_data.count()

denominacion_empresa    8247063
edad                    8247063
estado                  8247063
idaviso                 8247063
idpostulante            8247063
nivel_alcanzado         8247063
nivel_laboral           8247063
nombre_area             8247063
nombre_zona             8247063
sepostulo               8247063
sexo                    8247063
tipo_de_trabajo         8247063
dtype: int64

In [18]:
train_data.head()

,denominacion_empresa,edad,estado,idaviso,idpostulante,nivel_alcanzado,nivel_laboral,nombre_area,nombre_zona,sepostulo,sexo,tipo_de_trabajo
286,3962,38.0,0,1111371931,85AMz,0.0,0,7,1,0,2,1
287,529,66.0,0,1111374387,aXm1J,0.0,0,0,1,0,2,1
288,2400,38.0,0,1112456302,6VEEO,1.0,0,3,1,0,2,1
289,3755,42.0,1,1112022845,ezqvj,1.0,0,2,1,0,2,1
290,513,35.0,0,1112456289,aXAaD,1.0,0,5,1,0,1,1

In [19]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder
from collections import defaultdict

In [20]:
X = train_data[['denominacion_empresa','edad','estado','nivel_alcanzado'\
                ,'nivel_laboral','nombre_area','nombre_zona','sexo','tipo_de_trabajo']]
Y = train_data['sepostulo']

In [21]:
X_train, X_test, y_train, y_test = \
    train_test_split(X, Y, test_size=0.10, random_state=7506)

In [22]:
print("Tamaño de X:\t\t", len(X), "\nTamaño de X_train:\t", \
      len(X_train), "\nTamaño de X_test:\t", len(X_test), \
      "\n\nTamaño de y:\t\t", len(Y), "\nTamaño de y_train:\t",\
      len(y_train), "\nTamaño de y_test:\t", len(y_test))

Tamaño de X:		 8247063
Tamaño de X_train:	 7422356
Tamaño de X_test:	 824707

Tamaño de y:		 8247063
Tamaño de y_train:	 7422356
Tamaño de y_test:	 824707

In [23]:
import winsound
def play_beep():
    duration = 500  # millisecond
    freq = 480  # Hz
    winsound.Beep(freq, duration)
play_beep()

In [ ]:
# SVC
from sklearn.svm import SVC

svc = SVC(kernel="linear", C=0.025)
svc.fit(X_train, y_train)
play_beep()

In [ ]:
# Probamos la precisión con el set de prueba
precision = round(svc.score(X_test, y_test) * 100, 2)
play_beep()
print(precision)

In [ ]:
test_final = pd.read_csv('./data/test_final_100k.csv', low_memory=False)
test_final.head()

In [ ]:
a_predecir = pd.merge(test_final, postulantes, on = 'idpostulante', how = 'left')
a_predecir.count()

In [ ]:
a_predecir = pd.merge(a_predecir, avisos, on = 'idaviso', how = 'left')
a_predecir.count()

In [ ]:
a_predecir.head()

In [ ]:
del a_predecir['id']
del a_predecir['idaviso']
del a_predecir['idpostulante']
array_a_predecir = a_predecir.values

In [ ]:
probabilidades = []
predicciones = []
for x in array_a_predecir:
    #y_pred = lre.predict([x])
    #predicciones.append(y_pred)
    #print("Prediccion: " + str(y_pred))
    y_proba = svc.predict_proba([x])
    #print("Probabilidad de Acierto: " + str(round(y_proba[0][y_pred][0]* 100, 2))+"%")
    probabilidades.append(y_proba)

prob_post = []
for p in probabilidades:
    prob_post.append(p[0][1])

submit5 = pd.concat([test_final, pd.DataFrame(data = prob_post, \
                                             columns = ['sepostulo'])],axis=1)
del submit5['idaviso']
del submit5['idpostulante']
submit5.set_index('id', inplace = True)
submit5.to_csv('./submits/submit_svc1.csv', encoding='utf-8')
play_beep()